blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ggg"], ["author_id", 4], ["created_at", "2024-08-16 08:49:25.274994"], ["updated_at", "2024-08-16 08:49:25.274994"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save